
document.getElementById("btngen").addEventListener("click", generatePassword);
document.getElementById("btncopy").addEventListener("click", copypassword);

function copypassword() {
	var range = document.createRange();
	range.selectNode(document.getElementById("shgenpw"));
	window.getSelection().removeAllRanges(); // clear current selection
	window.getSelection().addRange(range); // to select text
	document.execCommand("copy");
	window.getSelection().removeAllRanges();// to deselect
}


window.onload = function() {
	document.getElementById("pwLength").value = getRandomNo(20,50);
    generatePassword();
};

var setUnique = "-–—์゜็ﾟ਼়़゚่้๊ੱਂੰִַָּֿ̐ʻً​!#$%&＆()*,，、.．。•/:：;?？@[\]^_`{|}~،؛؟’“”„「」ံ့း।+<>«»↑→©·･・★✧✩۽۾။၌၎၏0123456789aAáÁàÀâäăāĀãåąấầắằẫảẳạậặæbBcCćċĊĉĈčČçÇdDďđĐḍḌðeEéÉèÈêëěēĒẽęếềẻểẹệəƏfFgGġĠĝĜğģhHħiIıíìİîÎïīĩỉịjJĵkKķlLĺľļłmMṁnNńṅňñņoOóòôöōõőŐốồøỏơổọỌớờộởợpPqQrRřṛsSśŝŜšŠşṣșȘtTťṭțþÞuUúùûÛüŭūũůűủưụứừữửựvVwWxXyYýẏỹỷzZźżžŽαΑάβΒγΓδΔεΕέΈζΖηΗήΉθΘιΙίϊκΚλΛμΜνΝξΞοΟόΌπΠρΡσςΣτΤυΥύφΦχΧψΨωΩώаАбБвВгГѓғдДђеЕёЁәӘєжЖзЗѕиИѝйЙӣіІїјЈкКќқҚлЛљЉмМнНңњЊоОөӨпПрРсСтТћуУўӯӮүҮұфФхХҳҲцЦчЧҷҶџЏшШщЩъыьэЭюЮяЯաԱբԲգդԴեԵզէըթԹժիլխծկԿհՀձղճմՄյնՆշոՈչպջՋռսՍվՎտրցւփքՔօՕֆაბგდევზთიკლმნოპჟრსტუფქღყშჩცძწჭხჯჰアあィイいウうえォオおカかがキきギクくグぐけげコこゴごサさざシしじスすズずセせソそゾタたダだチちッっつづテてデでトとドどナなにネねノのハはバばパビびフブぶプべボぼポマまみムめモもャやュよラらリりルるレれロろワわをンんאבגדהוזחטיךכלםמןנסעףפץצקרשתءاإأآبٻڀپةتٺٿټٽٹثجڃڄچڇحځڅخدڈډڊڍڏذڌرږڑړزڙژسښشصضطظعغفڦقكګکڪگڳلمںنڼڻهہھوؤېۍىيےیئۓँंःअआइईउऊऍएऐऑओऔकखगघङचछजझञटठडढणतथदधनपफबभमयरऱलळवशषसहािीुूृॅेैॉोौ्ঁংঃঅআইউএওকখগঘঙচছজঞটঠডণতথদধনপফবভমযরলশষসহািীুূৃেৈো্ਉਊਓਅਆਐਇਈਏਸਹਕਖਗਘਚਛਜਝਟਠਡਢਣਤਥਦਧਨਪਫਬਭਮਯਰਲਵੜਾਿੀੁੂੇੈੋੌ੍ંઅઆઇઈઉઊઍએઑઓકખગઘચછજઝઞટઠડણતથદધનપફબભમયરલવશષસહળાિીુૂૃેૈૉોૌ્ஃஅஆஇஈஉஊஎஏஐஒஓகஙசஞடணதநபமயரலவழளறனஜஸஷஹாிீுூெேைொோௌ்ంఃఅఆఇఈఉఊఎఏఒకఖగఘచజటఠడణతథదధనపఫబభమయరలళవశషసహాిీుూృెేైొోౌ్ಂಃಅಆಇಈಉಎಏಐಒಓಕಖಗಘಚಛಜಝಟಠಡಢಣತಥದಧನಪಫಬಭಮಯರಲವಶಷಸಹಳಾಿೀುೂೃೆೇೈೊೋೌ್ൗംഃഅആഇഈഉഊഎഏഐഒഓഔകഖഗഘങചജഞടഡൺണതഥദധൻനപഫബഭമയരർറൽലൾളഴവശഷസഹാിീുൂൃെേൈൊോൌ്ංඃඅආඇඉඊඋඍඑඒඓඔඕකඛගඝඞඟචඡජඥටඨඩණඬතථදධනඳපබභමඹයරලවශෂසෆහළාැෑිීුූෘෙේෛොෝෞ්เแโใไกขคงจฉชซญฎฏฐฑฒณดตถทธนบปผฝพฟภมยรฤลวศษสหอฮะัาำิีึืุูๆကခဂဃငစဆဇဉညဋဌဍဏတထဒဓနပဖဗဘမယျရြလဝွသဟှဠအဤဥဧာါိီုူေဲ္်່້ໆກຂຄງຈສຊຍດຕຖທນບປຜຝພຟມຢຣລວຫອຮະາິີຶືຸູເແໂົຼຽໄໃັໍកខគឃងចឆជឈញដឋឌណតថទធនបផពភមយរ៌ឬលឮវសហឡអឥឧឯឱ៉៊ាិីឹឺុូួើឿៀេែៃោៅ្ំះៈ់័៍៏។ៗሃኃሁሄህኅሆኋለሉሊላሌልሎመሙሚማምሞሰሱሲሣሳሥስረሪራርሮሸሻሽሾቀቁቂቃቄቅቆቋበቡቢባቤብቧተቱታቴትቶቸቹቼችነኑኒናኔንኖኘኛኜኝኞአዓእዕከኩኪካክወዊዋውዎዘዙዚዛዝዞዥየዩያዬይደዱዲዳድዶጀጁጂገጉጋግጎጓጠጣጥጦጧጨጩጫጭጸጽፈፊፋፍፕቬ𐐀ㄱ가각간갈감갔강갖같개객갤거건걸것게격견결경계고골곳공과관광구국군굴권그극근글금기김까깜깥깨껴꾸꿔끄끝ㄴ나난날납났내낼냄냈너널넘녀년노녹농놓뇌누눈눴느는늘능니닙ㄷ다단달담답당대댈더던덮데도독돈돌동되된될두뒀드든들등디딘땅때떠떨또뜨ㄹ라락람래러런럴럼럽레려력련렸령로록론료류르른를름리릭린릴림릿ㅁ마막만많말맛망맡매메며면명몇모목몰몸못무문묻물뮤미믹밀및ㅂ바박밖반발밤방배밴버번법벤벽변병보복볼봉부분불붓붙뷰비빨ㅅ사삭살상새색생샷서선설성세섹셔셨소속손쇄쇼수술쉬쉽슈스슬습승시식신실심십싶쌍썩썼쓰씀ㅇ아악안앉않알암압았액야약양어억얻얼엄업없엇었엌에여연열였예오올와완왜외요용우운울워원월웠위유육으은을음응의이인일입있잊ㅈ자작잔잘장재쟁저적전절점정제졌조족존종좋주준줄중즈즉증지직진질집짝째ㅊ차착찬참창찾처천철첫체초최추축출취츠측치친칠침ㅋ칼캐캔커컨컵켓코콘콜콤크큰클키ㅌ타탁탄탈탕태터턴텔템토톨통투튄트특티틴팀ㅍ파판팝패퍼펀페편포폭폰표품풍플피필핑ㅎ하한할핥함합해했행허헤현혐호홀홍화확황회획후휴흘히ㅏㅐㅑㅒㅓㅔㅕㅖㅗㅘㅙㅛㅜㅝㅞㅟㅠㅡㅢㅣ一三上下不与且世东両两严並个中为主丽么之乎了事二于些亲人从他付代令以们份企伊休会似但住体何作你使供侧侵係俘保信倉個們候借做停偷偽備傳働像僚元克入全公兵其具冒决况冷几凡処出分切列別到前剣剥劃功加动励労勒動務化區十千升午单南単占压原厳去友反发取受叢口只可号叹吃各合同名后向吗否听告员周呼命和咖品哈員唯唱商問啡喜單嗅器四回因园国图國圖土在地坐坚執基報場增壁壊壕士声売处夏外多夜夠大天夺奖套女好如妨始嬉子它安完官定实実客害家容密富寒寓对対専将尋小就尽局屋属屬州工己已市带常平年并幸広废度庫庭开弃弹弾彈当彼往径待很徊律後従得徘從復心必忍応怎思怠性恐息悪情惧想意愛感懈應戏成我或戰戻所手扎打技抓拉拒拠拨持指挣捜採探接提握援損擇擊據擦支收放救敢散数整數料斯新方於旅无日早时明易昨是時晚暴曲更書最月有朋望朝期木未本机杆来板林果査栏树样根格案業榴構槍標樣機檢欠次欢欲欺歌止此步残殺每毛毯民气気氣求汗汽没沿況法注活海深清渡測渴満準灌灯炸点為热無照爆爭爱父牆物特犬狗狙独玛玩现現球理生産用由电界番當痴発發白的皮盗盟目盯直相看着知砲破確社福离私秘種空第答算管箱篮簡米約紛素紧終経結絡給絶經続練總續线练终经绒给绿罗置署美義考者而耳聊聞聲聽肢胎能脸腎腺自至般色苦荫著虏虑處行術街衝衣被装裝西要見規覺规觉解言計訓訟許訴詐試話該認誘說説読誰調請論警護订让训记设诉试话说谴販買賭購责走起超越足路跳躍身軍车转轮输込迅过返这远迫迷退送這通速造連週進遅遇過道違遞遭選那部都醒釋里重错門間间阱防阿际险陷陸隊際隻难集雇電需露静非面項須題類顧顿飛飞養饭馬馭駄駕験驱體高鬆鬥魅麻黑鼠鼻ー";

function generatePassword() {
    var output = "";
    var x = document.getElementById("pwLength").value;

    if (x < 8) {
        x = 8;
    }
	else if (x > 1000) {
		x = 1000;
	}

    x = x - 6;

    for (i = 1; i <= x; i++) {
        var randomNumber = Math.floor(Math.random() * setUnique.length);
        output += setUnique.charAt(randomNumber);
    }

    output = getSafeString() + output + getSafeString();

    document.getElementById("shgenpw").textContent = output;
    document.getElementById("shpwlength").textContent = "Password Length: " + output.length;
}

function getSafeString() {
    var setSafe = "~!@#$%^&*()_+`{}|[]\:;<>?,.//*-+wertyuiopasdfghjklzxcvbnmQWERTYUIOPASDFGHJKLZXCVBNM1234567890";
    var str = "";
    for (i = 1; i <= 3; i++) {
        var randomNumber = Math.floor(Math.random() * setSafe.length);
        str += setSafe.charAt(randomNumber);
    }
    return str;
}

function getRandomNo(min,max) {
    return Math.floor(Math.random()*(max-min+1)+min);
}